// MazeGame.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <conio.h>
#include "time.h"
#include "windows.h"
#include "CrtLib.h"

using namespace std;
using namespace crt;

const int LX = 75;
const int LY = 30;

const char player = (char)1;
// 0 - пустое пространство
// 1 - стена 
// 2 - выход
// 3 - игрок
// 4 - монета

int a = 0;
int b = 0;

void SetColor(int color) {
    HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);
    SetConsoleTextAttribute(hConsole, color);
}

int maze[LY][LX] = {
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,4,1,0,0,0,0,0,0,0,0,0,0,1,1,0,4,0,0,0,0,0,4,1,0,0,0,0,0,0,0,0,0,0,1,1,0,4,0,0,0,0,0,4,1,0,0,0,0,0,0,0,0,0,0,1,1,0,4,0,0,0,0,0,4,1,0,0,0,0,0,0,2},
{1,1,0,0,1,1,1,1,0,0,1,1,1,1,0,1,1,0,0,1,1,1,1,0,0,1,1,1,1,0,0,1,1,1,1,0,1,1,0,0,1,1,1,1,0,0,1,1,1,1,0,0,1,1,1,1,0,1,1,0,0,1,1,1,1,0,0,1,0,1,1,1,1,1,1},
{1,1,0,1,1,1,1,1,4,1,1,1,1,1,4,0,0,0,0,1,1,1,1,0,1,1,1,1,1,4,1,1,1,1,1,4,0,0,0,0,1,1,1,1,0,1,1,1,1,1,4,1,1,1,1,1,4,0,0,0,0,1,1,1,1,0,1,1,0,1,0,0,0,1,1},
{1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,0,1,0,1,1},
{1,1,0,1,0,0,0,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,0,0,0,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,0,0,0,1,0,1,1,1,1,1,1,0,1,1,1,1,1,1,1,0,1,0,0,1,4,1,0,1,1},
{1,1,0,1,0,0,1,1,0,1,1,1,1,1,1,0,0,1,1,1,1,1,1,0,1,0,0,1,1,0,1,1,1,1,1,1,0,0,1,1,1,1,1,1,0,1,0,0,1,1,0,1,1,1,1,1,1,0,0,1,1,1,1,1,1,0,1,0,1,1,1,1,0,1,1},
{1,1,0,1,4,0,1,1,0,1,1,1,1,1,1,0,0,1,1,1,1,1,1,0,1,4,0,1,1,0,1,1,1,1,1,1,0,0,1,1,1,1,1,1,0,1,4,0,1,1,0,1,1,1,1,1,1,0,0,1,1,1,1,1,1,0,1,0,1,4,0,0,0,1,1},
{1,1,0,1,0,0,1,1,0,1,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,0,1,1,0,1,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,0,1,1,0,1,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,1,0,0,0,1,1,1},
{1,1,0,1,0,0,1,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,0,1,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,0,1,1,0,0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,0,0,1,1},
{1,0,0,0,4,0,0,0,0,1,0,0,0,0,0,4,0,0,0,0,1,1,0,0,0,4,0,0,0,0,1,0,0,0,0,0,4,0,0,0,0,0,0,0,0,0,4,0,0,0,0,1,0,0,0,0,0,4,0,0,0,0,1,1,0,0,0,0,1,0,1,1,0,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,1,1,1,0,1,0,0,1,1},
{1,1,1,1,0,1,1,1,0,0,0,0,0,0,0,4,1,1,1,0,1,1,0,1,1,0,1,1,1,0,0,0,0,0,0,0,4,1,1,1,0,1,1,1,1,1,0,1,1,1,0,0,0,0,0,0,0,4,1,1,1,0,1,1,0,0,0,4,0,0,1,1,0,1,1},
{1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,0,1,1,1,0,1,1,0,1,1,0,1,1,1,0,1,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,0,0,1,1},
{1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,0,0,0,0,0,1,1,0,1,1,0,1,1,1,0,1,1,1,1,1,1,0,0,0,0,0,1,1,1,1,1,0,1,1,1,0,1,1,1,1,1,1,0,0,0,0,0,1,1,0,0,0,0,1,0,1,0,1,1,1},
{1,1,1,1,4,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,4,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,4,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,0,1,0,0,1,1},
{1,1,1,1,0,0,0,0,4,0,0,0,0,0,0,0,0,1,1,1,1,1,0,1,1,0,0,0,0,4,0,0,0,0,0,0,0,0,1,1,1,1,1,1,1,1,0,0,0,0,4,0,0,0,0,0,0,0,0,1,1,1,1,1,0,1,0,0,1,0,1,1,0,1,1},
{1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,0,0,1,1},
{1,1,1,1,0,1,0,0,4,0,0,0,0,0,1,1,1,1,1,1,1,1,0,1,1,0,1,0,0,4,0,0,0,0,0,1,1,1,1,1,1,1,1,1,1,1,0,1,0,0,4,0,0,0,0,0,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,0,1,1,1},
{1,1,1,1,0,1,0,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,0,1,1,0,1,0,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,1,1,0,0,1,1,1,1,1,1,1,1,0,1,0,1,0,0,0,0,0,1,1},
{1,1,1,1,0,1,0,1,4,0,0,0,0,4,0,0,0,0,0,0,1,1,0,1,1,0,1,0,1,4,0,0,0,0,4,0,0,0,0,0,0,1,1,1,1,1,0,1,0,1,4,0,0,0,0,4,0,0,0,0,0,0,1,1,0,1,0,1,4,1,0,1,1,1,1},
{1,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,0,1,1,0,1,0,1,0,0,0,0,0,1,1},
{1,1,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,1,0,1,0,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,0,1,1,1,0,1,0,1,1},
{1,1,1,1,0,1,0,0,0,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,0,0,0,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,0,0,0,1,1,1,1,1,1,1,1,1,1,0,1,1,4,1,0,0,0,0,0,1,0,0,1},
{1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1},
{1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,4,0,0,0,0,0,0,0,0,0,1},
{1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,4,0,0,0,0,0,1,1,1,1,1},
{1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,4,1},
{1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
};

// глобальные переменные
int hx, hy; // позиция игрока в лабиринте
int score = 0; // счет игры

int gameState = 0; // 0 - игра продолжается, 1 - выигрыш, 2 - закончилось время
int timeLimit = 155; // лимит игры в секундах
int gameTime; // оставшееся время

clock_t tstart; // значение счетчика таймера при старте игры

// Функция обновляет текущий счет на экране
void UpdateScore(int score)
{
    SetColor(3); // Меняет цвет счёта
    GotoXY(35, 30); // ставим курсор на последнюю строку консоли
    setlocale(LC_ALL, "ru-RU"); // включаем локаль, ориентированную на кириллицу
    cout << "СЧЕТ: " << score;  // выводим счет на экран
    setlocale(LC_ALL, "C"); // возвращаем настройки локали по умолчанию
}

// Функция обновляет оставшееся время до окончания игры
// параметр t функции - это текущее значение системного таймера, на момент вызова функции
void UpdateClock(clock_t t)
{
    SetColor(2);
    gameTime = timeLimit - (t - tstart) / CLOCKS_PER_SEC; /* вычисляем оставшееся время в секундах
                    и помещаем результат в gameTime. (t-tstart) - кол-во миллисекунд, прошедшее
                    с момента старта игры. CLOCKS_PER_SEC - константа, определяющая количество
                    изменений системного таймера за 1 секунду. Для Windows это значение 
                    равно 1000. Вычитая из timeLimit время, прошедшее с начала игры, мы вычисляем
                    остаток времени в секундах */
    setlocale(LC_ALL, "ru-RU"); // переключаем локаль
    if (gameTime < 15) {
        SetColor(4); // Если время меньше 15 то перекрасить его в красный
    }
    if (gameTime < 0) // проверяем, закончилось ли время
    {
        gameState = 2; // если да, то обновляем статус игры на 2 - игрок ПРОИГРАЛ
    }
    else
    {  // если время осталось
        GotoXY(49, 30); // ставим курсор на последнюю строку
        cout << "Осталось: " << gameTime << " секунд "; // выводим остаток времени в консоль
    }
    setlocale(LC_ALL, "C"); // восстанавливаем настройки локали
}

// Функция печатает в консоли лабиринт
void PrintMaze(int maze[LY][LX], int sizeX, int sizeY)
{
    for (int i = 0; i < sizeY; i++)
    {
        for (int j = 0; j < sizeX; j++)
        {
            switch (maze[i][j])
            {
            case 0:
                cout << ' ';
                break;
            case 1:
                SetColor(4); // Меняет цвет стенам
                cout << (char)178;
                break;
            case 2:
                SetColor(8); // Меняет цвет выходу
                cout << (char)176;
                break;
            case 3:
                SetColor(7); // Меняет цвет игроку
                cout << player;
                break;
            case 4:
                SetColor(6); // Меняет цвет монетам
                cout << '$';
                break;
            default:
                cout << '?';
            }
        }
        cout << endl;
    }
}

// Функция определяет позицию игрока в массиве, обновляя значения глобальных переменных hx и hy
void FindFirstPlayerPosition(int maze[LY][LX], int sizeX, int sizeY)
{

    for (int i = 0; i < sizeY; i++)  // цикл пробегает массив по строкам
    {
        for (int j = 0; j < sizeX; j++) // цикл пробегает массив по столбцам
        {
            if (maze[i][j] == 2)    // проверяем, если текущий элемент равен 3 - нашли
            {
                a++; // считает количество игроков
            }
        }
    }

    for (int i = 0; i < sizeY; i++)  // цикл пробегает массив по строкам
    {
        for (int j = 0; j < sizeX; j++) // цикл пробегает массив по столбцам
        {
            if (maze[i][j] == 3)    // проверяем, если текущий элемент равен 3 - нашли
            {
                b++; // считает количество игроков
            }
        }
    }

    if (a != 1 || b != 1) { 
        gameState = 2; // заканчивает игру если количество игроков или выходов не равно 1 
    }

    for (int i = 0; i < sizeY; i++)  // цикл пробегает массив по строкам
    {
        for (int j = 0; j < sizeX; j++) // цикл пробегает массив по столбцам
        {
            if (maze[i][j] == 3)    // проверяем, если текущий элемент равен 3 - нашли
            {                       // требуемую позицию
                hx = j;             // записываем столбец в hx
                hy = i;             // записываем строку в hy
                SetColor(7);        // Меняет цвет персонажу при ходьбе
                return;             // завершаем работу функции
            }
        }
    }
    hx = hy = 0;    // если ничего не нашли - предполагаем, что игрок в позиции 0,0
}                   // это нелогично, но пока ничего предпринимать не будем, решение
                    // этой проблемы будет вашим персональным заданием по рефакторингу игры



//Функция скрывает игрока с экрана и убирает его из лабиринта
void HidePlayer()
{
    maze[hy][hx] = 0; // записываем в текущую позицию матрицы число 0
    GotoXY(hx, hy); // устанавливаем курсор в позицию игрока в консоль
    cout << ' ';    // и печатаем пробел
}

// функция показывает на экране игрока и записывает его в лабиринт
void ShowPlayer()
{
    maze[hy][hx] = 3; // записываем в текущую позицию матрицы число 0
    GotoXY(hx, hy); // устанавливаем курсор в позицию игрока в консоль
    cout << player; // и печатаем образ игрока
}


void MovePlayer(int dx, int dy)
{
    if (hx + dx < LX && hy + dy < LY && hx + dx >= 0 && hy + dy >= 0)
    {
        switch (maze[hy + dy][hx + dx]) { // Проверяем, что находится в ячейке матрицы 
        case 0: // Если там пусто, то ход возможен
            SetColor(7); // Меняет цвет персонажу при ходьбе
            HidePlayer(); // Скрываем игрока с экрана
            hx += dx; // Обновляем координату x
            hy += dy; // Обновляем координату y
            ShowPlayer(); // Отображаем игрока в новой позиции 
            break;
        case 2: // Если там дверь выхода
            HidePlayer();
            hx += dx;
            hy += dy;
            ShowPlayer();
            UpdateScore(score += 500); // Добавляем 500 бонусов за достижение выхода из лабиринта
            gameState = 1; // Изменяем статус игры на ВЫИГРЫШ
            break;
        case 4: // Если там монета
            HidePlayer();
            hx += dx;
            hy += dy;
            ShowPlayer();
            UpdateScore(score += 100); // Добавляем 100 бонусов за сбор монеты
            break;
        }
    }
}

void Control()
{
    tstart = clock();
    UpdateScore(score); 
    unsigned char x; // Это переменная хранит символ, соответствующий нажатой клавише
    while (gameState == 0) // Цикл игры - пока gameState == 0, игра идет
    {
        UpdateClock(clock()); // Обновляем оставшееся время 
        if (_kbhit()) {// Если была нажата клавиша - то обрабатываем ее, иначе следующая итерация игрового цикла 
        x = _getch(); // Считываем символ нажатой клавиш 
        if (x == 27) return; // Если это символ Esc (27) то это выход из игры
        if (x == 0xe0) // Если это символ с кодом 0xE0 (шестнадцатеричное)
            switch (_getch()) // Считываем еще один символ (некоторые клавиши выдают двойные коды)
            {
            case 72: // Если 2-й символ код 72, то это клавиша курсор вверх
                MovePlayer(0, -1); // Идем вверх
                break;
            case 80: // Если 2-й символ код 80, то это клавиша курсор вниз
                MovePlayer(0, 1); // Идем вниз 
                break;
            case 75: // Если 2-й символ код 75, то это клавиша курсор влево
                MovePlayer(-1, 0); // Идем влево 
                break;
            case 77: // Если 2-й символ код 77, то это клавиша курсор вправо 
                MovePlayer(1, 0); // Идем вправо
                break;
            }
        }
    Sleep(150); // Останавливаем игру на 200 мсек
    }
}

// Функция main, которая выполняется при запуске прграммы
int main()
{
    system("mode con cols=80 lines=31");
    system("cls");
    PrintMaze(maze, LX, LY);
    FindFirstPlayerPosition(maze, LX, LY);
    HideCursor();
    Control();
    ShowCursor();
}

